#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_cloud_run_service.api-run: Refreshing state... [id=locations/us-central1/namespaces/practice-cicd-mtk/services/api-run]
google_project_service.service["run.googleapis.com"]: Refreshing state... [id=practice-cicd-mtk/run.googleapis.com]
google_project_service.service["compute.googleapis.com"]: Refreshing state... [id=practice-cicd-mtk/compute.googleapis.com]
google_project_service.service["containerregistry.googleapis.com"]: Refreshing state... [id=practice-cicd-mtk/containerregistry.googleapis.com]
google_compute_network.vpc_network: Refreshing state... [id=projects/practice-cicd-mtk/global/networks/cicd-network]
google_compute_firewall.develop: Refreshing state... [id=projects/practice-cicd-mtk/global/firewalls/ssh-firewall]
google_compute_firewall.frontend: Refreshing state... [id=projects/practice-cicd-mtk/global/firewalls/http-firewall]
google_compute_instance.nginx_instance: Refreshing state... [id=projects/practice-cicd-mtk/zones/us-central1-c/instances/reverse-proxy]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_cloud_run_service.api-run has been changed
  ~ resource "google_cloud_run_service" "api-run" {
        id       = "locations/us-central1/namespaces/practice-cicd-mtk/services/api-run"
        name     = "api-run"
      + project  = "practice-cicd-mtk"
      + status   = [
          + {
              + conditions                   = [
                  + {
                      + message = "Image 'asia.gcr.io/practice-cicd-mtk/hello' not found."
                      + reason  = "ContainerMissing"
                      + status  = "False"
                      + type    = "Ready"
                    },
                  + {
                      + message = "Image 'asia.gcr.io/practice-cicd-mtk/hello' not found."
                      + reason  = "ContainerMissing"
                      + status  = "False"
                      + type    = "ConfigurationsReady"
                    },
                  + {
                      + message = "Image 'asia.gcr.io/practice-cicd-mtk/hello' not found."
                      + reason  = ""
                      + status  = "Unknown"
                      + type    = "RoutesReady"
                    },
                ]
              + latest_created_revision_name = "api-run-7whjs"
              + latest_ready_revision_name   = ""
              + observed_generation          = 1
              + url                          = ""
            },
        ]
        # (1 unchanged attribute hidden)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/ingress"        = "all"
              + "run.googleapis.com/ingress-status" = "all"
              + "serving.knative.dev/creator"       = "terraform-deploy@practice-cicd-mtk.iam.gserviceaccount.com"
              + "serving.knative.dev/lastModifier"  = "terraform-deploy@practice-cicd-mtk.iam.gserviceaccount.com"
            }
          + generation       = 1
          + labels           = {
              + "cloud.googleapis.com/location" = "us-central1"
            }
          + namespace        = "practice-cicd-mtk"
          + resource_version = "AAXKMWu7Yj4"
          + self_link        = "/apis/serving.knative.dev/v1/namespaces/608639825831/services/api-run"
          + uid              = "2032c5f3-c117-4a33-8212-b0dd7a04e984"
        }

      ~ template {
          + metadata {
              + annotations = {
                  + "autoscaling.knative.dev/maxScale" = "100"
                }
              + generation  = 0
              + labels      = {}
            }

          ~ spec {
              ~ container_concurrency = 0 -> 80

              ~ containers {
                  + args    = []
                  + command = []
                    # (1 unchanged attribute hidden)

                  ~ resources {
                      + requests = {}
                        # (1 unchanged attribute hidden)
                    }
                }
            }
        }

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_service.api-run is tainted, so must be replaced
-/+ resource "google_cloud_run_service" "api-run" {
      ~ id       = "locations/us-central1/namespaces/practice-cicd-mtk/services/api-run" -> (known after apply)
        name     = "api-run"
      ~ project  = "practice-cicd-mtk" -> (known after apply)
      ~ status   = [
          - {
              - conditions                   = [
                  - {
                      - message = "Image 'asia.gcr.io/practice-cicd-mtk/hello' not found."
                      - reason  = "ContainerMissing"
                      - status  = "False"
                      - type    = "Ready"
                    },
                  - {
                      - message = "Image 'asia.gcr.io/practice-cicd-mtk/hello' not found."
                      - reason  = "ContainerMissing"
                      - status  = "False"
                      - type    = "ConfigurationsReady"
                    },
                  - {
                      - message = "Image 'asia.gcr.io/practice-cicd-mtk/hello' not found."
                      - reason  = ""
                      - status  = "Unknown"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "api-run-7whjs"
              - latest_ready_revision_name   = ""
              - observed_generation          = 1
              - url                          = ""
            },
        ] -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              - "run.googleapis.com/ingress"        = "all"
              - "run.googleapis.com/ingress-status" = "all"
              - "serving.knative.dev/creator"       = "terraform-deploy@practice-cicd-mtk.iam.gserviceaccount.com"
              - "serving.knative.dev/lastModifier"  = "terraform-deploy@practice-cicd-mtk.iam.gserviceaccount.com"
            } -> (known after apply)
          ~ generation       = 1 -> (known after apply)
          ~ labels           = {
              - "cloud.googleapis.com/location" = "us-central1"
            } -> (known after apply)
          ~ namespace        = "practice-cicd-mtk" -> (known after apply)
          ~ resource_version = "AAXKMWu7Yj4" -> (known after apply)
          ~ self_link        = "/apis/serving.knative.dev/v1/namespaces/608639825831/services/api-run" -> (known after apply)
          ~ uid              = "2032c5f3-c117-4a33-8212-b0dd7a04e984" -> (known after apply)
        }

      ~ template {
          - metadata {
              - annotations = {
                  - "autoscaling.knative.dev/maxScale" = "100"
                } -> null
              - generation  = 0 -> null
              - labels      = {} -> null
            }

          ~ spec {
              - container_concurrency = 80 -> null
              + serving_state         = (known after apply)

              ~ containers {
                  - args    = [] -> null
                  - command = [] -> null
                  ~ image   = "asia.gcr.io/practice-cicd-mtk/hello" -> "gcr.io/practice-cicd-mtk/hello"

                  ~ resources {
                      - requests = {} -> null
                        # (1 unchanged attribute hidden)
                    }
                }
            }
        }

      ~ traffic {
            # (2 unchanged attributes hidden)
        }
    }

  # google_project_iam_member.inference-invoker-iam will be created
  + resource "google_project_iam_member" "inference-invoker-iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/run.invoker"
    }

  # google_service_account.api-run-service-account will be created
  + resource "google_service_account" "api-run-service-account" {
      + account_id   = "api-run-service-account"
      + display_name = "Service Account for API Cloud Run"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @marltake, Action: `pull_request`, Working Directory: ``, Workflow: `terraform CI/CD`*